# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
p = 96
number = int(input('Введите номер буквы'))
print(chr(p + number))

